---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachCutParam
source: html/a6fc4a6a-1207-2fbf-a3b2-4341ff1d4d0c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachCutParam Property

"Top Attachment Cut"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnTopAttachCutParam { get; }
```